package com.example.dreamdrummer;

public class Questions {


    public static String[][] getraid() { //raid
        String[][] quizData = {
                {"סוג הצליל של הרייד?", "עדין", "גס", "דומיננטי וחזק", "נמוך"},
                {"למה הרייד משמש?", "ליווי בצורה עדינה", "ליווי חזק ודומיננטי", "שמירת קצב", "הכתבת הצליל"},
                {"ממה מורכב הרייד?", "פעמון ומצילה גדולה", "מצילה", "פעמון", "תוף מתוח"},

    };
        return quizData;
    }


    public static String[][] getbas() { //bas
        String[][] quizData = {
                {"שם נוסף לבאס?", "קיק", "רגל", "כף", "עקב"},
                {"סוג הצלי של הבאס?", "נמוך מאוד", "חזק", "דומיננטי", "גס ועוצמתי"},
                {"מהו השימוש לתוף הבאס?", "מקצב וטון", "שמירה על קצב", "הדגשה", "ליווי עדין"},
               };
        return quizData;
    }
    public static String[][] getsnare() { //snare
        String[][] quizData = {
                {"סוג הצליל של הסנייר?", "חד וחזק", "חלש ועדין", "עמום", "שטוח ונמוך"},
                {"מהו השימוש של הסנייר?", "שמירה על הקצב", "ליווי", "מעברים", "מקצב וטון"},
                {"איך מכים את הסנייר?", "בצורה חזקה במרכז התוף", "בצד התוף", "בצורה חלשה במרכז התוף", "בצידו השמאלי בצורה חזקה"},};

        return quizData;
    }

    public static String[][] gettamtam() { //tamtam
        String[][] quizData = {
                {"כמה טמטמים יש במערת תופים?", "3", "2", "4", "5"},
                {"איזה טמטם הכי רפוי?", "פלור", "טמטם אחד", "טמטם שתיים", "טמטם מרכז"},
                {"סוג הצליל של הטמטמים?", "עמום וארוך", "עמום וקצר", "חד וחזק", "עדין וחלש"},
                {"למה משמשים הטמטמים?", "מעברים", "הכתבת קצב", "ליווי עדין", "מצקב וטון"},
     };
        return quizData;
    }


    public static String[][] gethayet() { //hayet
        String[][] quizData = {
                {"ממה מורכב ההיט?", "2 מצילות", "פעמון ומצילה", "תוף מתוח", "מצילה אחת"},
                {"סוג הצליל של ההיט?", "גדול ודומיננטי", "עדין", "נמוך", "עמום"},
                {"למה משמש ההייט?", "ליווי חזק", "ליווי עדין", "עמום", "חלש וחד"},};

        return quizData;
    }

    public static String[][] getcrash() { //crash
        String[][] quizData = {
                {"סוג הצליל של הקראש?", "גס ועוצמתי", "עמום", "עדין וחלש", "אף תשובה אינה נכונה"},
                {"מהו השימוש של הקראש?", "הדגשה חזקה", "ליווי חזק", "הכתבת קצב", "מעברים"},
                {"שם נוסף לקראש?", "מצילה", "ספלאש", "פלור", "קיק"},};

        return quizData;
    }

}

